WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
  if(! firstCallFirstTime)
  {
    firstCallFirstTime = true;
    
    // Global initiation
    _hardwareConfigDone = false;
    _meadowAdcUserInit = false;
    _doubVrefInCal = 0.0;

    // Signaling semaphore
    sem_init(&_waitTillDoneSem, 0, 0);
    sem_setprotocol(&_waitTillDoneSem, SEM_PRIO_NONE);  

    // Do before configuration
    _dmaAdcBuf = kmm_malloc(MEADOW_ADC_MAX_DMA_BUFFER_SIZE);
    if(_dmaAdcBuf == NULL)
    {
      syslog(LOG_ERR, "%s@%d-Error:Buffer space not available\n",
                  __FILE__, __LINE__);
      return -ENOMEM;   // Out of memory
    }

    memset(_dmaAdcBuf, 0, MEADOW_ADC_MAX_DMA_BUFFER_SIZE);
    _dmaHandle = NULL;
  }
  return OK;
}

/************************************************************************************
 * Public Functions
 ************************************************************************************/
// This function can handle as few as 1 GPIO and as many as 16 GPIOs with a
// buffer with space for all 16.
int meadow_adc_configure(uint8_t gpioList[], uint32_t gpioCount,
          double *resultBuffer)
{
  int ret;
  uint32_t gpioListOff;
  uint32_t mapOff = 0;

  ret = meadow_adc_check_first_func_call();
  if(ret < 0)
  {
    syslog(LOG_ERR, "Meadow adc config failed. ret:%d\n", ret);
    return ret;
  }

#if defined CONFIG_ADC_TESTS
  syslog(1, "meadow_adc_configure() gpioCount:%lu, resultBuffer:%p\n",
            gpioCount, resultBuffer);
#endif

  // Check for valid and reasonable input parameters
  if(_meadowAdcUserInit)
  {
    syslog(LOG_ERR, "%s@%d-Error:There is already an active configuration.\n",
              __FILE__, __LINE__);
    return -EPERM;    // Operation not permitted
  }

  if(resultBuffer == NULL)
  {
    syslog(1, "%s@%d-Error:resultBuffer is NULL\n",
              __FILE__, __LINE__);
    return -EINVAL;   // Invalid argument
  }
  
  // Verify GPIO list is valid
  for(gpioListOff = 0; gpioListOff < gpioCount; gpioListOff++)
  {
    // Look for matching port/pin in the list
    for(mapOff = 0; mapOff < MEADOW_ADC_GPIO_CHAN_MAP_LENGTH; mapOff++)
    {
      if(gpioList[gpioListOff] == _gpioAdcChanMap[mapOff])
        break;   // Found-it's connected to the ADC
    }

    // Did we go through the entire list and not find a match?
    if(mapOff == MEADOW_ADC_GPIO_CHAN_MAP_LENGTH)
    {
      syslog(LOG_INFO, "GPIO:0x%02x (P%c%d) not connected to ADC\n", gpioList[gpioListOff],
                  (gpioList[gpioListOff] >> 4) + 'A', gpioList[gpioListOff] & 0x0f);
      return -EINVAL;   // Invalid argument
    }
  }

  //----------------------------------------------
  // Passed the tests so save needed user parameters
  _userGpioXferCount = gpioCount;
  _userVoltageResultBuf = resultBuffer;
  _meadowAdcUserInit = true;

  // There are 3 initialization steps to fully initialize the ADC for analog
  // GPIO data conversion. The first of these can be done at an earlier time
  // as it's needed for reading the internal MCU temperature and battery
  // voltage.
  if(!_hardwareConfigDone)
  {
    ret = meadow_adc_hardware_initialize();
    if(ret < 0)
    {
      syslog(LOG_ERR, "Initialization failed. ret:%d\n", ret);
      return ret;
    }
  }

  ret = meadow_adc_config_sequence_regs(gpioCount, gpioList);
  if(ret < 0)
  {
    syslog(LOG_ERR, "Initialization failed. ret:%d\n", ret);
    return ret;
  }

  meadow_adc_dma_initialize(_dmaAdcBuf, _userGpioXferCount);

  return OK;
}

//=========================================================
// This public function will return the values for Vbat and Vtemp from the
// internal STM32F7 chip. The internal sersors have calibration values written
// into the chip at the time of manufacturing. This function will use these
// values to provide the most accurate possible information to the caller.
//
// Quote from Ref Man 15.10
// "The temperature sensor output voltage changes linearly with temperature.
// The offset of this linear function depends on each chip due to process
// variation (up to 45°C from one chip to another).
// The internal temperature sensor is more suited for applications that detect
// temperature variations instead of absolute temperatures. If accurate
// temperature reading is required, an external temperature sensor should be
// used"
int meadow_adc_read_temp_vbat(double *batteryVoltage, double *tempValue)
{
  int ret;
  uint16_t adcTempReading;
  uint16_t adcBatteryReading;
  uint16_t adcVrefInCal;

  ret = meadow_adc_check_first_func_call();
  if(ret < 0)
  {
    syslog(LOG_ERR, "Reading Temp/Vbat failed. ret:%d\n", ret);
    return ret;
  }

  // Has the hardware configuration been done already?
  if(!_hardwareConfigDone)
  {
    // (--) FWIW-This will call meadow_adc_read_injected_temp_vref, so the following
    // call is a duplicate but only once.
    ret = meadow_adc_hardware_initialize();
    if(ret < 0)
    {
      syslog(LOG_ERR, "Reading Temp/Vbat failed. ret:%d\n", ret);
      return ret;
    }
  }

  // This must be before reading Vbat because it reads and sets _doubVrefInCal
  // which is used for both temperature and voltage calculations
  ret = meadow_adc_read_injected_temp_vref(&adcTempReading, &adcVrefInCal);
  if(ret < 0)
  {
    syslog(LOG_ERR, "Temperature/Vref read error, ret:%d\n", ret);
    return ret;
  }

  // From Data Sheet (not Ref Man), temperatures calibration values have been
  // read at 30 and 110 degrees celsius. 
  double calAtDegC30_t1  = 30.0;     // Calibration temperature 1 in DegC
  double calAtDegC110_t2 = 110.0;    // Calibration temperature 2 in DegC
  // Get the STM factory calibration values stored in these registers.
  double calRefVal_CAL  = (double) getreg16(MEADOW_ADC_VREFINT_CAL_ADDR);
  double tempCal1_TEMP1 = (double) getreg16(MEADOW_ADC_TEMPSENSOR_CAL30_ADDR);
  double tempCal2_TEMP2 = (double) getreg16(MEADOW_ADC_TEMPSENSOR_CAL110_ADDR);

  // The adc temperature measurement value (0-4095) needs to be converted to
  // a temperature value. To do the best conversion the information in the
  // Data Sheet needs to be incorporated in the math.
  // The following equation came from http://efton.sk/STM32/STM32_VREF.pdf.
  *tempValue = calAtDegC30_t1 + (calAtDegC110_t2 - calAtDegC30_t1) * \
            ((double)adcTempReading * calRefVal_CAL - \
            tempCal1_TEMP1 * _doubVrefInCal) / \
            (_doubVrefInCal * (tempCal2_TEMP2 - tempCal1_TEMP1));

// Peter - HERE (*)
  double voltageBefore;
  double voltageAfter;
  uint16_t adcBattery;
  ret = meadow_adc_read_injected_vbat(&adcBattery);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%04d-Vbat Conversion Error. ret:%d\n", ret);
    return ret;
  }
  meadow_adc_convert_adc_to_voltage(adcBattery * 4, &voltageBefore);
  meadow_adc_convert_adc_to_voltage(adcBattery, &voltageAfter);
  syslog(1, "-->> adc:%u, voltageBefore:%.3f, voltageAfter:%.3f\n", adcBattery, voltageBefore, voltageAfter * 4);
  *batteryVoltage = voltageAfter;
  
  // (*) THIS IS THE REAL CODE
  // // Now do the same for the battery voltage and internal CAL reference
  // ret = meadow_adc_read_injected_vbat(&adcBatteryReading);
  // if(ret < 0)
  // {
  //   syslog(LOG_ERR, "%04d-Vbat Conversion Error. ret:%d\n", ret);
  //   return ret;
  // }

  // // Convert the Vbat reading into a voltage value
  // double voltageAsRead;
  // ret = meadow_adc_convert_adc_to_voltage(adcBatteryReading, &voltageAsRead);
  // if(ret < 0)
  // {
  //   syslog(LOG_ERR, "%04d-Conversion Cleanup Error. ret:%d\n", ret);
  //   return ret;
  // }

