WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
  // // Note:Per Ref Man section 15.11 the Battery voltage read is VBAT/4
  // // If we multiple before the conversion to voltage the result is much
  // // smaller.
  // *batteryVoltage = (voltageAsRead * 4);

  return OK;
}

//================================================================
// Calling this function will free all the allocations and configurations
// that the current active configuration has changed.
int meadow_adc_unconfigure_active_config()
{
  uint32_t regval;
  
  // Turn off ADC
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  regval &= ~ADC_CR2_ADON;
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

  // Stop DMA
  regval  = getreg32(STM32_DMA2_S0CR);
  regval &= ~DMA_SCR_EN;
  putreg32(regval, STM32_DMA2_S0CR);

  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR1_OFFSET);
  regval &= ~ADC_CR1_SCAN;           // 1=Scan mode (Scans channels in ADC_SQRx registers)
  regval &= ~ADC_CR1_EOCIE;          // 1=Enable ADC interrupt for EOC (not with DMA)
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR1_OFFSET);

  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  regval &= ~ADC_CR2_DMA;          // 0=Disable DMA
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

  regval = getreg32(STM32_ADC1_SQR1);
  regval &= ADC_SQR1_RESERVED;   // Clear all SQR Bits
  putreg32(regval, STM32_ADC1_SQR1);

  regval = getreg32(STM32_ADC1_SQR2);
  regval &= ADC_SQR2_RESERVED;   // Clear all SQR Bits
  putreg32(regval, STM32_ADC1_SQR2);

  regval = getreg32(STM32_ADC1_SQR3);
  regval &= ADC_SQR3_RESERVED;   // Clear all SQR Bits
  putreg32(regval, STM32_ADC1_SQR3);

  regval = getreg32(STM32_ADC_CCR);
  regval &= ~ADC_CCR_TSVREFE;       // 0=disable temperature sensor channel
  regval &= ~ADC_CCR_VBATE;         // 0=disable vbat channel
  regval &= ~ADC_CCR_ADCPRE_MASK;   // Clear any bits in ADC prescaler
  regval &= ~ADC_CCR_DMA_MASK;      // Clear any bits in DMA mode (multi-ADC mode only) 
  regval &= ~ADC_CCR_DELAY_MASK;    // 0000=5*Tadcclk (only used for dual/triple)
  regval &= ~ADC_CCR_MULTI_MASK;    // Clear any bits
  regval |= ADC_CCR_MULTI_NONE;     // 00000=Independent mode
  putreg32(regval, STM32_ADC_CCR);

  // The active configuration must have an active DMA handle from the Nuttx
  // DMA configuration call.
  if(_dmaHandle != NULL)
  {
    stm32_dmastop(_dmaHandle);
    stm32_dmafree(_dmaHandle); 
  }
  _dmaHandle = NULL;

  if(_dmaAdcBuf != NULL)
  {
    free(_dmaAdcBuf);
  }

  _meadowAdcRegInit = false;
  return OK;
}

//=========================================================
// Calling this function will initiate the ADC converstion process. It will
// run until the configured buffer is full. When the buffer is full (or error)
// the calling thread will return to the caller, signifing that the buffer
// is ready for inspection.
int meadow_adc_read_conversions(void)
{
  if(! _meadowAdcUserInit)
  {
    syslog(LOG_ERR, "%s@%d-Error:Meadow ADC not configured.\n",
              __FILE__, __LINE__);
    return -EPERM;    // Operation not permitted
  }

  // Since not doing continous conversion we need to start ADC each time
  meadow_adc_restart();

  // Wait for conversion to finish for valid data
  meadow_adc_buffer_takesem(&_waitTillDoneSem);

  // The following is used to determine if the output truely follows the analog
  // input as it switches above and below mid-point of Vdd.
#if MEADOW_ADC_TEST_TOGGLE_ADC_INPUT > 0
  // Note to execute the following display adds about 26 ms
  // Show data before copy
  static int callCount = 0;
  static int previousNoChg = 0;
  callCount++;
  if(previousNoChg != _noChangeCnt)
  {
    syslog(LOG_ERR, "%04d-Error Count:%05d\n", callCount, _noChangeCnt - 1);
  }
  previousNoChg = _noChangeCnt;
#endif

  // ADC conversion must have completed. Now convert the collected data
  // to voltage and copy to the user's buffer.
  for(int valOff = 0; valOff < _userGpioXferCount; valOff++)
  {
    int ret;
    double convVoltage;

    // _dmaAdcBuf contain the adc output values (0-4095) placed there by DMA.
    //  Convert these values to a voltage and return it to the user.
    ret = meadow_adc_convert_adc_to_voltage(_dmaAdcBuf[valOff], &convVoltage);
    if(ret < 0)
    {
      syslog(LOG_ERR, "%04d-Conversion Cleanup Error. ret:%d\n", ret);
      return ret;
    }

    syslog(1, "%d...Regular ADC:%u, Voltage%.3f\n", valOff + 1, _dmaAdcBuf[valOff], convVoltage);

    // Don't know the cause but, the voltage returned for GPIOs is exactly
    // 0.50 volts too high, from 0 - 3.3.
    _userVoltageResultBuf[valOff] = convVoltage - 0.5;
  }

  return OK;
}
